Вотерхаус_Бухгалтерия_30.Бюджет/src/Documents/бджВводПланаДвиженийДенежныхСредств/бджВводПланаДвиженийДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>бджВводПланаДвиженийДенежныхСредств</name>
  <registerRecords>AccumulationRegister.бджПланДвиженийДенежныхСредств</registerRecords>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Вотерхаус_Бухгалтерия_30.Бюджет/src/AccumulationRegisters/бджПланДвиженийДенежныхСредств/бджПланДвиженийДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бджПланДвиженийДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Вотерхаус_Бухгалтерия_30.Бюджет/src/Documents/бджВводПланаДвиженийДенежныхСредств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработка проведения.
// 
// Параметры:
//  Отказ 			- Булево 					- Отказ
//  РежимПроведения - РежимПроведенияДокумента 	- Режим проведения
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ДанныеДляПроведения = ДанныеДляПроведенияДокумента();
	Движения.бджПланДвиженийДенежныхСредств.Записывать = Истина;
	Для Каждого ПланСтрока Из ДанныеДляПроведения.План Цикл
		Движение = Движения.бджПланДвиженийДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ПланСтрока);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Данные для проведения документа.
// 
// Возвращаемое значение:
//  Структура - Данные для проведения документа:
// * План - ТаблицаЗначений
//
Функция ДанныеДляПроведенияДокумента()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	План.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СУММА(План.Сумма) КАК Сумма,
	|	План.Ссылка КАК Регистратор,
	|	План.Ссылка.Месяц КАК Период,
	|	План.Ссылка.Организация
	|ИЗ
	|	Документ.бджВводПланаДвиженийДенежныхСредств.План КАК План
	|ГДЕ
	|	План.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	План.СтатьяДвиженияДенежныхСредств,
	|	План.Ссылка,
	|	План.Ссылка.Месяц,
	|	План.Ссылка.Организация";
	Возврат Новый Структура("План", Запрос.Выполнить().Выгрузить());

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
